tf/XMLs/AirCreateReservationReq.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header/>
  <s:Body>
    <univ:AirCreateReservationReq xmlns:common_v33_0="http://www.travelport.com/schema/common_v33_0" xmlns:univ="http://www.travelport.com/schema/universal_v33_0" xmlns="http://www.travelport.com/schema/air_v33_0" TargetBranch="P2629804" RetainReservation="Both">
      <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v33_0" OriginApplication="UAPI"/>
      <BookingTraveler xmlns="http://www.travelport.com/schema/common_v33_0" Key="0" TravelerType="ADT" DOB="2002-07-18" Gender="M">
        <BookingTravelerName First="veera" Last="kamaraj"/>
        <PhoneNumber Number="8970649021" Type="Mobile"/>
        <Email EmailID="veeramani.tekhne@gmail.com" Type="P"/>
        <Address>
          <AddressName>test</AddressName>
          <Street>test</Street>
          <City>Bangalore</City>
          <!--<State>_adultCO</State>-->
          <PostalCode>560068</PostalCode>
          <Country>NL</Country>
        </Address>
      </BookingTraveler>
      <ContinuityCheckOverride xmlns="http://www.travelport.com/schema/common_v33_0">YES</ContinuityCheckOverride>
      <FormOfPayment xmlns="http://www.travelport.com/schema/common_v33_0" Type="Cash"/>
      <AirPricingSolution Key="QC7BOrsXTdOW+xzFoqh5Kw==" TotalPrice="EUR191.62" BasePrice="INR12065" ApproximateTotalPrice="EUR191.62" ApproximateBasePrice="EUR163.00" EquivalentBasePrice="EUR163.00" Taxes="EUR28.62" ApproximateTaxes="EUR28.62" QuoteDate="2016-07-16">
        <AirSegment Key="Diron9riQA2z3wGvcNU/kw==" Group="0" Carrier="9W" FlightNumber="464" ProviderCode="1G" Origin="MAA" Destination="BOM" DepartureTime="2016-08-23T05:40:00.000+05:30" ArrivalTime="2016-08-23T07:30:00.000+05:30" FlightTime="110" TravelTime="110" Distance="644" ClassOfService="H" Equipment="738" ChangeOfPlane="false" OptionalServicesIndicator="true" ParticipantLevel="Secure Sell" LinkAvailability="true" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
          <AirAvailInfo ProviderCode="1G">
            <BookingCodeInfo BookingCounts="C7|J5|Z4|I2|P2|Y7|M7|T7|U7|N7|L7|Q7|S7|K7|H7|V0|O0|W0|B0"/>
          </AirAvailInfo>
          <FlightDetails Key="aiBVaMy1TYWIrVOJr+UJVQ==" Origin="MAA" Destination="BOM" DepartureTime="2016-08-23T05:40:00.000+05:30" ArrivalTime="2016-08-23T07:30:00.000+05:30" FlightTime="110" TravelTime="110" Distance="644"/>
        </AirSegment>
        <AirSegment Key="p+w0UpBcQ2WeUyYrVHnI7A==" Group="0" Carrier="9W" FlightNumber="618" ProviderCode="1G" Origin="BOM" Destination="PNQ" DepartureTime="2016-08-23T10:05:00.000+05:30" ArrivalTime="2016-08-23T10:50:00.000+05:30" FlightTime="45" TravelTime="45" Distance="78" ClassOfService="H" Equipment="737" ChangeOfPlane="false" OptionalServicesIndicator="true" ParticipantLevel="Secure Sell" LinkAvailability="true" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
          <AirAvailInfo ProviderCode="1G">
            <BookingCodeInfo BookingCounts="C5|J4|Z4|I2|P2|Y7|M7|T7|U7|N7|L7|Q7|S7|K7|H7|V0|O0|W0|B0"/>
          </AirAvailInfo>
          <FlightDetails Key="OVDgBrRTSNWTZCthQbhrFw==" Origin="BOM" Destination="PNQ" DepartureTime="2016-08-23T10:05:00.000+05:30" ArrivalTime="2016-08-23T10:50:00.000+05:30" FlightTime="45" TravelTime="45" Distance="78"/>
          <Connection/>
        </AirSegment>
        <AirSegment Key="aff8uAf6SSWkfZZ7qW8rrQ==" Group="0" Carrier="9W" FlightNumber="2842" ProviderCode="1G" Origin="PNQ" Destination="BLR" DepartureTime="2016-08-23T13:35:00.000+05:30" ArrivalTime="2016-08-23T15:10:00.000+05:30" FlightTime="95" TravelTime="95" Distance="449" ClassOfService="H" Equipment="737" ChangeOfPlane="false" OptionalServicesIndicator="true" ParticipantLevel="Secure Sell" LinkAvailability="true" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
          <AirAvailInfo ProviderCode="1G">
            <BookingCodeInfo BookingCounts="C7|J7|Z7|I2|P2|Y7|M7|T7|U7|N7|L7|Q7|S7|K7|H7|V7|O7|W7|B0|V0|W0|C5|J4|O0|Z4"/>
          </AirAvailInfo>
          <FlightDetails Key="OMehCJsaQZCe9/8RTDmImw==" Origin="PNQ" Destination="BLR" DepartureTime="2016-08-23T13:35:00.000+05:30" ArrivalTime="2016-08-23T15:10:00.000+05:30" FlightTime="95" TravelTime="95" Distance="449"/>
        </AirSegment>
        <AirPricingInfo Key="NFcK9uw3TlSJchYNj+kf6Q==" TotalPrice="EUR191.62" BasePrice="INR12065" ApproximateTotalPrice="EUR191.62" ApproximateBasePrice="EUR163.00" EquivalentBasePrice="EUR163.00" ApproximateTaxes="EUR28.62" Taxes="EUR28.62" LatestTicketingTime="2016-08-23T23:59:00.000+02:00" PricingMethod="Manual" Refundable="true" IncludesVAT="false" ETicketability="Yes" ProviderCode="1G">
          <FareInfo Key="uEO0TkHfQO+0QUYAg+1OBQ==" FareBasis="H2CFA" PassengerTypeCode="ADT" Origin="MAA" Destination="PNQ" EffectiveDate="2016-07-16T20:12:00.000+02:00" DepartureDate="2016-08-23" Amount="EUR89.00" NotValidBefore="2016-08-23" NotValidAfter="2016-08-23">
            <FareRuleKey FareInfoRef="uEO0TkHfQO+0QUYAg+1OBQ==" ProviderCode="1G">6UUVoSldxwiLvYq/+PrbU8bKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5w/vVPxVdg0M3ExqSoG051V8WXcGevEcpwIYa/+6aP+VCulqMwbpNZybsj0U79PWcZlVM7p9pCv9SxMi9UXmeLq/20RpEmAXlby9IE1rxlSp7GoYpQef1jVLG6sBsurcjZmgTAepcNgAGwhtowZL8GAdcY0m0a4yk4nKb2G5mOFXMjf0ajY+O2DxjQI/emRa7+F729rtUMfv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx80GqQ2wgDK/01BlpTwyo+r9GjARZYw7j/TROTkGAG0MSyp+nCP+vwqvrcYYCR6K5jcF7TvWtaxDwRBPzkgD+ze</FareRuleKey>
            <FareRuleFailureInfo>
              <Reason>RoutingFailure</Reason>
            </FareRuleFailureInfo>
          </FareInfo>
          <FareInfo Key="Egn8PKMtT5qwiR2hpXWHqA==" FareBasis="H2IPO" PassengerTypeCode="ADT" Origin="PNQ" Destination="BLR" EffectiveDate="2016-07-16T20:12:00.000+02:00" DepartureDate="2016-08-23" Amount="EUR74.00" NotValidBefore="2016-08-23" NotValidAfter="2016-08-23">
            <FareSurcharge Key="ADJo2PY1S86DxK5eqVdU2g==" Type="Other" Amount="NUC10.00"/>
            <FareRuleKey FareInfoRef="Egn8PKMtT5qwiR2hpXWHqA==" ProviderCode="1G">6UUVoSldxwiLvYq/+PrbU8bKj3F8T9EyxsqPcXxP0TIjSPOlaHfQe5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA5w/vVPxVdg0M3ExqSoG050Z6KjyDnzE2pwgyPgiiZcZffAIozri2ABybsj0U79PWWUB2lVjeHod9SxMi9UXmeLq/20RpEmAXlby9IE1rxlSp7GoYpQef1g2xhlZTAsk+dO+0sTtWKkmWSBtu8DJJm2AdcY0m0a4yk4nKb2G5mOFOnxdqX0Yx6BGZsiS1uG5+r+F729rtUMfv4Xvb2u1Qx+/he9va7VDH7+F729rtUMfv4Xvb2u1Qx80GqQ2wgDK/01BlpTwyo+r9GjARZYw7j/TROTkGAG0MVA7iQHOx+FfHCsPA97757/cF7TvWtaxDwRBPzkgD+ze</FareRuleKey>
          </FareInfo>
          <BookingInfo BookingCode="H" CabinClass="Economy" FareInfoRef="uEO0TkHfQO+0QUYAg+1OBQ==" SegmentRef="Diron9riQA2z3wGvcNU/kw=="/>
          <BookingInfo BookingCode="H" CabinClass="Economy" FareInfoRef="uEO0TkHfQO+0QUYAg+1OBQ==" SegmentRef="p+w0UpBcQ2WeUyYrVHnI7A=="/>
          <BookingInfo BookingCode="H" CabinClass="Economy" FareInfoRef="Egn8PKMtT5qwiR2hpXWHqA==" SegmentRef="aff8uAf6SSWkfZZ7qW8rrQ=="/>
          <TaxInfo Category="F2" Amount="EUR0.35" Key="5/SkWC6pTKS3P1BKKIpgEg=="/>
          <TaxInfo Category="G1" Amount="EUR0.35" Key="KLV6EvsqQS6kBuW/FZv5GA=="/>
          <TaxInfo Category="IN" Amount="EUR2.58" Key="vtz3iVrwQA+Z7ofWLRRRAw=="/>
          <TaxInfo Category="JN" Amount="EUR9.81" Key="OpvCnoNCRD+iW39npJGpVA=="/>
          <TaxInfo Category="WO" Amount="EUR3.37" Key="AhT8Zq2MSv+/3tPlfKFrEw=="/>
          <TaxInfo Category="YQ" Amount="EUR10.80" Key="NFpZeOfAT5uH35jlg59HzA=="/>
          <TaxInfo Category="YR" Amount="EUR1.36" Key="y/CQvUJkRV+G9WllbVCESQ=="/>
          <FareCalc>MAA 9W X/BOM 9W PNQ Q MAAPNQ10.00 88.97H2CFA 9W BLR Q10.00 71.75H2IPO NUC180.72END ROE66.759</FareCalc>
          <PassengerType Code="ADT" BookingTravelerRef="0"/>
          <ChangePenalty>
            <Amount>EUR41.00</Amount>
          </ChangePenalty>
          <CancelPenalty>
            <Amount>EUR48.00</Amount>
          </CancelPenalty>
          <BaggageAllowances>
            <BaggageAllowanceInfo TravelerType="ADT" Origin="MAA" Destination="BLR" Carrier="9W">
              <URLInfo>
                <URL>MYTRIPANDMORE.COM/BAGGAGEDETAILS9W.BAGG</URL>
              </URLInfo>
              <TextInfo>
                <Text>15K</Text>
                <Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</Text>
              </TextInfo>
              <BagDetails ApplicableBags="1stChecked">
                <BaggageRestriction>
                  <TextInfo>
                    <Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text>
                  </TextInfo>
                </BaggageRestriction>
              </BagDetails>
              <BagDetails ApplicableBags="2ndChecked">
                <BaggageRestriction>
                  <TextInfo>
                    <Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</Text>
                  </TextInfo>
                </BaggageRestriction>
              </BagDetails>
            </BaggageAllowanceInfo>
            <CarryOnAllowanceInfo Origin="MAA" Destination="BOM" Carrier="9W">
              <TextInfo>
                <Text>1P</Text>
              </TextInfo>
              <CarryOnDetails ApplicableCarryOnBags="1" BasePrice="USD0.00" TotalPrice="USD0.00">
                <BaggageRestriction>
                  <TextInfo>
                    <Text>CARRYON HAND BAGGAGE ALLOWANCE</Text>
                  </TextInfo>
                </BaggageRestriction>
              </CarryOnDetails>
            </CarryOnAllowanceInfo>
            <CarryOnAllowanceInfo Origin="BOM" Destination="PNQ" Carrier="9W">
              <TextInfo>
                <Text>1P</Text>
              </TextInfo>
              <CarryOnDetails ApplicableCarryOnBags="1" BasePrice="USD0.00" TotalPrice="USD0.00">
                <BaggageRestriction>
                  <TextInfo>
                    <Text>CARRYON HAND BAGGAGE ALLOWANCE</Text>
                  </TextInfo>
                </BaggageRestriction>
              </CarryOnDetails>
            </CarryOnAllowanceInfo>
            <CarryOnAllowanceInfo Origin="PNQ" Destination="BLR" Carrier="9W">
              <TextInfo>
                <Text>1P</Text>
              </TextInfo>
              <CarryOnDetails ApplicableCarryOnBags="1" BasePrice="USD0.00" TotalPrice="USD0.00">
                <BaggageRestriction>
                  <TextInfo>
                    <Text>CARRYON HAND BAGGAGE ALLOWANCE</Text>
                  </TextInfo>
                </BaggageRestriction>
              </CarryOnDetails>
            </CarryOnAllowanceInfo>
          </BaggageAllowances>
        </AirPricingInfo>
        <FareNote Key="oHDsqNH1SuC/hI+8K8fbeQ==">RATE USED IN EQU TOTAL IS BSR 1INR - 0.013479EUR</FareNote>
        <FareNote Key="QU2LrHFARy+WOfpMNQSDdg==">LAST DATE TO PURCHASE TICKET: 23AUG16</FareNote>
        <FareNote Key="PFoTbLA+QsaQ33dWmG5/Lw==">E-TKT REQUIRED</FareNote>
        <FareNote Key="QubegGspRUuzHr3GS6A2SA==">TICKETING FEES MAY APPLY</FareNote>
      </AirPricingSolution>
      <ActionStatus xmlns="http://www.travelport.com/schema/common_v33_0" ProviderCode="1G" TicketDate="T*" Type="ACTIVE" QueueCategory="01"/>
    </univ:AirCreateReservationReq>
  </s:Body>
</s:Envelope>
